# parameters
nc: 80  # number of classes

# modify by lzj 因为depth_multiple和width_multiple的原因，mobilenetv2的结构改起来有点恶心
# modify by lzj 还是TMD改掉吧，但是下面的参数得改了
#depth_multiple: 0.33  # model depth multiple
#width_multiple: 0.50  # layer channel multiple

depth_multiple: 1  # model depth multiple
width_multiple: 1  # layer channel multiple

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 backbone
backbone:
  #
  # https://blog.csdn.net/wa1tzy/article/details/114492726
  # 为了让检测头对4,6,10,14的引用能够正确的concat,在这些层应该使用pointwise卷积改变通道数
  # [from, number, module, args]
  # input:1x3x256x256
  [ [ -1, 1, Conv, [32, 3, 2] ],  # 0-P1/2 32x128x128
    [ -1, 1, InvertedResidual, [ 16, 1, 1 ] ],  # 1         16x128x128
    [ -1, 1, InvertedResidual, [ 24, 2, 6 ] ],  # 2-P2/4   24x64x64
    [ -1, 1, InvertedResidual, [ 24, 1, 6 ] ],  # 3-P2/4   24x64x64
    [ -1, 1, InvertedResidual, [ 32, 2, 6 ] ],  # 4-P3/8   32x32x32
    [ -1, 1, InvertedResidual, [ 32, 1, 6 ] ],  # 5-P3/8   32x32x32
    [ -1, 1, InvertedResidual, [ 32, 1, 6 ] ],  # 6-P3/8   32x32x32
    [-1, 1, PW_Conv, [256]],                    # 7  output p3 256x32x32
    [ -1, 1, InvertedResidual, [ 64, 2, 6 ] ],  # 8-P4/16  64x16x16
    [ -1, 1, InvertedResidual, [ 64, 1, 6 ] ],  # 9-P4/16  64x16x16
    [ -1, 1, InvertedResidual, [ 64, 1, 6 ] ],  # 10-P4/16  64x16x16
    [ -1, 1, InvertedResidual, [ 64, 1, 6 ] ],  # 11-P4/16 64x16x16
    [ -1, 1, PW_Conv, [512]],                   # 12 output p4  512x16x16
    [ -1, 1, InvertedResidual, [ 96, 1, 6 ] ],  # 13       96X16x16
    [ -1, 1, InvertedResidual, [ 96, 1, 6 ] ],  # 14       96X16x16
    [ -1, 1, InvertedResidual, [ 96, 1, 6 ] ],  # 15       96X16x16
    [ -1, 1, InvertedResidual, [ 160, 2, 6 ] ], # 16-P5/32  160X8x8
    [ -1, 1, InvertedResidual, [ 160, 1, 6 ] ], # 17-P5/32  160X8x8
    [ -1, 1, InvertedResidual, [ 160, 1, 6 ] ], # 18-P5/32  160X8x8
    [ -1, 1, InvertedResidual, [ 320, 1, 6 ] ],  # 19       320X8x8
    [ -1, 1, nn.Conv2d, [ 1280, 1, 1 ] ],     # 20          1280x8x8
    [ -1, 1, SPP, [1024, [ 5, 9, 13 ] ] ],  # 21     #      1024x8x8
  ]


# YOLOv5 head
head:
  [[-1, 1, C3, [512, False]],  # 22    512x8x8


   [-1, 1, Conv, [256, 1, 1]], # 23    256x8x8
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 24 256x16x16
   [[-1, 12], 1, Concat, [1]],  # 25 cat backbone P4 768x16x16
   [-1, 1, C3, [256, False]],  # 26 256x16x16

   [-1, 1, Conv, [128, 1, 1]], # 27 128x16x16
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 28 128x32x32
   [[-1, 7], 1, Concat, [1]],  # 29 cat backbone P3 384x32x32
   [-1, 1, C3, [128, False]],  # 30 (P3/8-small) 128x32x32

   [-1, 1, Conv, [128, 3, 2]],  # 31 128x16x16
   [[-1, 27], 1, Concat, [1]],  # 32 cat head P4 256x16x16
   [-1, 1, C3, [256, False]],  # 33 (P4/16-medium) 256x16x16

   [-1, 1, Conv, [256, 3, 2]],  # 34 256x8x8
   [[-1, 23], 1, Concat, [1]],  # 35 cat head P5 512x8x8
   [-1, 1, C3, [512, False]],  # 36 (P5/32-large) 512x8x8

   [[30, 33, 36], 1, Detect, [nc, anchors]],  # 37 Detect(P3, P4, P5)
  ]
